Ran Plan for project: `eks/eksd_apnortheast2/eksdapne2-gjvj` dir: `terraform/eks/eksd_apnortheast2/eksdapne2-gjvj` workspace: `default`

<details><summary>Show Output</summary>

```diff

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
+ create
~ update in-place
-/+ destroy and then create replacement
 <= read (data resources)

Terraform will perform the following actions:

  # module.eks.data.aws_security_group.cluster_sg will be read during apply
  # (depends on a resource or a module with changes pending)
 <= data "aws_security_group" "cluster_sg" {
      + arn         = (known after apply)
      + description = (known after apply)
      + id          = (known after apply)
      + name        = (known after apply)
      + region      = (known after apply)
      + tags        = {
          + "aws:eks:cluster-name" = "eksdapne2-gjvj"
        }
      + vpc_id      = (known after apply)
    }

  # module.eks.data.tls_certificate.oidc will be read during apply
  # (depends on a resource or a module with changes pending)
 <= data "tls_certificate" "oidc" {
      + certificates = (known after apply)
      + id           = (known after apply)
      + url          = "https://oidc.eks.ap-northeast-2.amazonaws.com/id/3B1BF3C8A6B5F0F73BA761D591F05E6E"
    }

  # module.eks.aws_autoscaling_group_tag.aws_node_termination_handler_asg[0] will be created
+ resource "aws_autoscaling_group_tag" "aws_node_termination_handler_asg" {
      + autoscaling_group_name = (known after apply)
      + id                     = (known after apply)
      + region                 = "ap-northeast-2"

      + tag {
          + key                 = "aws-node-termination-handler/managed"
          + propagate_at_launch = true
          + value               = "true"
        }
    }

  # module.eks.aws_autoscaling_group_tag.aws_node_termination_handler_asg[1] will be created
+ resource "aws_autoscaling_group_tag" "aws_node_termination_handler_asg" {
      + autoscaling_group_name = (known after apply)
      + id                     = (known after apply)
      + region                 = "ap-northeast-2"

      + tag {
          + key                 = "aws-node-termination-handler/managed"
          + propagate_at_launch = true
          + value               = "true"
        }
    }

  # module.eks.aws_autoscaling_lifecycle_hook.aws_node_termination_handler_asg[0] will be created
+ resource "aws_autoscaling_lifecycle_hook" "aws_node_termination_handler_asg" {
      + autoscaling_group_name = (known after apply)
      + default_result         = "CONTINUE"
      + heartbeat_timeout      = 300
      + id                     = (known after apply)
      + lifecycle_transition   = "autoscaling:EC2_INSTANCE_TERMINATING"
      + name                   = (known after apply)
      + region                 = "ap-northeast-2"
    }

  # module.eks.aws_autoscaling_lifecycle_hook.aws_node_termination_handler_asg[1] will be created
+ resource "aws_autoscaling_lifecycle_hook" "aws_node_termination_handler_asg" {
      + autoscaling_group_name = (known after apply)
      + default_result         = "CONTINUE"
      + heartbeat_timeout      = 300
      + id                     = (known after apply)
      + lifecycle_transition   = "autoscaling:EC2_INSTANCE_TERMINATING"
      + name                   = (known after apply)
      + region                 = "ap-northeast-2"
    }

  # module.eks.aws_ec2_tag.karpenter_cluster_sg_tag must be replaced
-/+ resource "aws_ec2_tag" "karpenter_cluster_sg_tag" {
      ~ id          = "sg-0e1ccc9ae940f05b3,karpenter.sh/discovery" -> (known after apply)
      ~ resource_id = "sg-0e1ccc9ae940f05b3" # forces replacement -> (known after apply) # forces replacement
        # (3 unchanged attributes hidden)
    }

  # module.eks.aws_eks_addon.coredns will be created
+ resource "aws_eks_addon" "coredns" {
      + addon_name                  = "coredns"
      + addon_version               = "v1.11.4-eksbuild.2"
      + arn                         = (known after apply)
      + cluster_name                = "eksdapne2-gjvj"
      + configuration_values        = jsonencode(
            {
              + nodeSelector = {
                  + capacity_type = "cpu_on_demand"
                }
            }
        )
      + created_at                  = (known after apply)
      + id                          = (known after apply)
      + modified_at                 = (known after apply)
      + region                      = "ap-northeast-2"
      + resolve_conflicts_on_create = "OVERWRITE"
      + tags_all                    = (known after apply)
    }

  # module.eks.aws_eks_addon.kube_proxy will be created
+ resource "aws_eks_addon" "kube_proxy" {
      + addon_name                  = "kube-proxy"
      + addon_version               = "v1.30.0-eksbuild.2"
      + arn                         = (known after apply)
      + cluster_name                = "eksdapne2-gjvj"
      + configuration_values        = (known after apply)
      + created_at                  = (known after apply)
      + id                          = (known after apply)
      + modified_at                 = (known after apply)
      + region                      = "ap-northeast-2"
      + resolve_conflicts_on_create = "OVERWRITE"
      + tags_all                    = (known after apply)
    }

  # module.eks.aws_eks_cluster.eks_cluster will be updated in-place
~ resource "aws_eks_cluster" "eks_cluster" {
        id                            = "eksdapne2-gjvj"
        name                          = "eksdapne2-gjvj"
        tags                          = {
            "Name"       = "eksdapne2-gjvj"
            "account"    = "id"
            "aws_region" = "ap-northeast-2"
            "product"    = "eks"
            "shard_id"   = "eksdapne2"
        }
      ~ version                       = "1.34" -> "1.33"
        # (13 unchanged attributes hidden)

        # (7 unchanged blocks hidden)
    }

  # module.eks.aws_eks_node_group.eks_node_group["ondemand_default"] will be created
+ resource "aws_eks_node_group" "eks_node_group" {
      + ami_type               = "AL2023_x86_64_STANDARD"
      + arn                    = (known after apply)
      + capacity_type          = "ON_DEMAND"
      + cluster_name           = "eksdapne2-gjvj"
      + disk_size              = (known after apply)
      + id                     = (known after apply)
      + instance_types         = [
          + "t3.large",
        ]
      + labels                 = {
          + "capacity_type" = "cpu_on_demand"
          + "cpu_chip"      = "intel"
        }
      + node_group_name        = "eksdapne2-gjvj-ng-ondemand_default"
      + node_group_name_prefix = (known after apply)
      + node_role_arn          = "arn:aws:iam::533267446521:role/eks-eksdapne2-gjvj-ng"
      + region                 = "ap-northeast-2"
      + release_version        = "1.33.2-20260120"
      + resources              = (known after apply)
      + status                 = (known after apply)
      + subnet_ids             = [
          + "subnet-000678337485e5661",
          + "subnet-00e1af4eaee00f88a",
        ]
      + tags                   = {
          + "Name"                                 = "eksdapne2-gjvj-ng-ondemand_default"
          + "account"                              = "id"
          + "aws_region"                           = "ap-northeast-2"
          + "kubernetes.io/cluster/eksdapne2-gjvj" = "owned"
          + "product"                              = "eks"
          + "shard_id"                             = "eksdapne2"
        }
      + tags_all               = {
          + "Name"                                 = "eksdapne2-gjvj-ng-ondemand_default"
          + "account"                              = "id"
          + "aws_region"                           = "ap-northeast-2"
          + "kubernetes.io/cluster/eksdapne2-gjvj" = "owned"
          + "product"                              = "eks"
          + "shard_id"                             = "eksdapne2"
        }
      + version                = (known after apply)

      + launch_template {
          + id      = "lt-01d6201ab49dc5445"
          + name    = (known after apply)
          + version = "1"
        }

      + scaling_config {
          + desired_size = 1
          + max_size     = 2
          + min_size     = 0
        }

      + update_config {
          + max_unavailable = 1
        }
    }

  # module.eks.aws_eks_node_group.eks_node_group["spot_default"] will be created
+ resource "aws_eks_node_group" "eks_node_group" {
      + ami_type               = "AL2023_x86_64_STANDARD"
      + arn                    = (known after apply)
      + capacity_type          = "SPOT"
      + cluster_name           = "eksdapne2-gjvj"
      + disk_size              = (known after apply)
      + id                     = (known after apply)
      + instance_types         = [
          + "t3.large",
        ]
      + labels                 = {
          + "capacity_type" = "spot"
          + "cpu_chip"      = "intel"
        }
      + node_group_name        = "eksdapne2-gjvj-ng-spot_default"
      + node_group_name_prefix = (known after apply)
      + node_role_arn          = "arn:aws:iam::533267446521:role/eks-eksdapne2-gjvj-ng"
      + region                 = "ap-northeast-2"
      + release_version        = "1.33.2-20260120"
      + resources              = (known after apply)
      + status                 = (known after apply)
      + subnet_ids             = [
          + "subnet-000678337485e5661",
          + "subnet-00e1af4eaee00f88a",
        ]
      + tags                   = {
          + "Name"                                 = "eksdapne2-gjvj-ng-spot_default"
          + "account"                              = "id"
          + "aws_region"                           = "ap-northeast-2"
          + "kubernetes.io/cluster/eksdapne2-gjvj" = "owned"
          + "product"                              = "eks"
          + "shard_id"                             = "eksdapne2"
        }
      + tags_all               = {
          + "Name"                                 = "eksdapne2-gjvj-ng-spot_default"
          + "account"                              = "id"
          + "aws_region"                           = "ap-northeast-2"
          + "kubernetes.io/cluster/eksdapne2-gjvj" = "owned"
          + "product"                              = "eks"
          + "shard_id"                             = "eksdapne2"
        }
      + version                = (known after apply)

      + launch_template {
          + id      = "lt-01d6201ab49dc5445"
          + name    = (known after apply)
          + version = "1"
        }

      + scaling_config {
          + desired_size = 1
          + max_size     = 5
          + min_size     = 0
        }

      + update_config {
          + max_unavailable = 1
        }
    }

  # module.eks.aws_iam_openid_connect_provider.eks will be updated in-place
~ resource "aws_iam_openid_connect_provider" "eks" {
        id              = "arn:aws:iam::533267446521:oidc-provider/oidc.eks.ap-northeast-2.amazonaws.com/id/3B1BF3C8A6B5F0F73BA761D591F05E6E"
        tags            = {}
      ~ thumbprint_list = [
          - "06b25927c42a721631c1efd9431e648fa62e1e39",
        ] -> (known after apply)
        # (4 unchanged attributes hidden)
    }

Plan: 9 to add, 2 to change, 1 to destroy.

```

* :arrow_forward: To **apply** this plan, comment:
    * `atlantis apply -p eks/eksd_apnortheast2/eksdapne2-gjvj`
* :put_litter_in_its_place: To **delete** this plan click [here](https://atlantis.overtake.live/lock?id=alpha3002025%252Feks-tf-provisioning%252Fterraform%252Feks%252Feksd_apnortheast2%252Feksdapne2-gjvj%252Fdefault)
* :repeat: To **plan** this project again, comment:
    * `atlantis plan -p eks/eksd_apnortheast2/eksdapne2-gjvj`
</details>
Plan: 9 to add, 2 to change, 1 to destroy.

---
* :fast_forward: To **apply** all unapplied plans from this pull request, comment:
    * `atlantis apply`
* :put_litter_in_its_place: To delete all plans and locks for the PR, comment:
    * `atlantis unlock`
